In [2]:
import pandas as pd

Q1. List any five functions of the pandas library with execution.

read_csv() - This function is used to read data from a CSV file and create a DataFrame object.

In [24]:
df = pd.read_csv('student.csv')
print(df.head())

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

groupby() - This function is used to group data by one or more columns and apply an aggregate function to each group.

In [25]:
grouped = df.groupby('name')['mark'].mean()
print(grouped.head())

name
Alex John     55.0
Arnold        55.0
Asruid        85.0
Babby John    69.0
Big John      55.0
Name: mark, dtype: float64

fillna() - This function is used to fill missing values in a DataFrame with a specified value or method.

In [15]:
import numpy as np
df1 = pd.DataFrame({'A': [1, 2, np.nan, 4],
                   'B': [5, np.nan, 7, 8],
                   'C': [np.nan, 10, 11, 12]})

df1 = df1.fillna(df1.mean())

print(df1)

          A         B     C
0  1.000000  5.000000  11.0
1  2.000000  6.666667  10.0
2  2.333333  7.000000  11.0
3  4.000000  8.000000  12.0

pivot_table() - This function is used to create a pivot table from a DataFrame, which summarizes the data by one or more columns.

In [21]:
pivot = df.pivot_table(values='id', index='name', columns='class')
print(pivot.head())

class       Eight  Fifth  Five  Four  Nine  Seven  Six  Three
name
Alex John     NaN    NaN   NaN   6.0   NaN    NaN  NaN    NaN
Arnold        NaN    NaN   NaN   NaN   NaN    NaN  NaN    3.0
Asruid        NaN    NaN   8.0   NaN   NaN    NaN  NaN    NaN
Babby John    NaN    NaN   NaN  21.0   NaN    NaN  NaN    NaN
Big John      NaN    NaN   NaN  10.0   NaN    NaN  NaN    NaN

to_csv() - This function is used to write data from a DataFrame to a CSV file.

In [23]:
df2 = pd.DataFrame({'Name': ['nk', 'ram', 'krsna'],
                   'Age': [25, 30, 35],
                   'Salary': [50000, 60000, 70000]})

df2.to_csv('output.csv', index=False)

df2 = pd.read_csv('output.csv')
print(df2)

    Name  Age  Salary
0     nk   25   50000
1    ram   30   60000
2  krsna   35   70000

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [26]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]})
print(df)

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [59]:
def index(df):
    new_index = range(1, 2*len(df), 2)
    df = df.set_index(pd.Index(new_index))
    return df

In [60]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]})
print(index(df))

   A  B  C
1  1  4  7
3  2  5  8
5  3  6  9

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [62]:
df = pd.DataFrame({'Values': [100, 20, 34, 41, 57,22,49]})

In [61]:
def values_sum(df):
    ls = df.iloc[:3]['Values'].sum()
    return ls

In [63]:
values_sum(df)

154

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [64]:
df = pd.DataFrame({'Text': ['Data Science', 'Python', 'Web Dev']})

In [65]:
def word_count(df):
    df['Word_Count'] = df['Text'].apply(lambda s: len(str(s).split()))
    return df

In [66]:
word_count(df)

           Text  Word_Count
0  Data Science           2
1        Python           1
2       Web Dev           2

Q5. How are DataFrame.size() and DataFrame.shape() different?

DataFrame.size() returns the number of elements in the DataFrame, which is equal to the number of rows times the number of columns. In other words, it returns the total number of cells in the DataFrame.

DataFrame.shape() returns a tuple that contains the number of rows and columns in the DataFrame. The first element of the tuple is the number of rows, and the second element is the number of columns.

In [39]:
df.size

6

In [40]:
df.shape

(3, 2)

In the above cases, the size gives 6 because the dataframe has 6 cells. Whereas, shape gives tuple indicating 3 rows and 2 columns.

Q6. Which function of pandas do we use to read an excel file?

The read_excel() function is a Pandas function that reads an Excel file into a DataFrame. It can read data from both .xls and .xlsx file formats.

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [69]:
df = pd.DataFrame({'Email': ['nk@gmail.com', 'sun@twitter.com', 'dsm@pwskills.com','webdev@pwskills.com','java@pwskills.com']})
def username(df):
    df['Username'] = df['Email'].apply(lambda s: s.split('@')[0])
    return df

In [70]:
username(df)

                 Email Username
0         nk@gmail.com       nk
1      sun@twitter.com      sun
2     dsm@pwskills.com      dsm
3  webdev@pwskills.com   webdev
4    java@pwskills.com     java

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [72]:
df = pd.DataFrame({'A': [1, 2, 3, 6, 7, 10, 11, 19, 16],
                   'B': [4, 5, 6, 2, 5, 9, 10,12,16],
                   'C': [7, 8, 9, 2, 6, 7, 8, 18, 20]})
def new_df(df):
    cond = (df['A'] > 5) & (df['B'] < 10)
    df_new = df[cond]
    return df_new

In [73]:
new_df(df)

    A  B  C
3   6  2  2
4   7  5  6
5  10  9  7

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [75]:
df = pd.DataFrame({'Values': [1, 2, 3, 6, 7, 10, 11, 19, 16]})

In [80]:
def calculated(df):
    mean = df['Values'].mean()
    median = df['Values'].median()
    sd = df['Values'].std()
    return {'Mean':round(mean,2),'Median':median,'Standard Deviation':round(sd,2)}

In [81]:
calculated(df)

{'Mean': 8.33, 'Median': 7.0, 'Standard Deviation': 6.24}

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [94]:
import numpy as np

dates = pd.date_range(start='2023-02-01', periods=28, freq='D')
sales = np.random.randint(10, 100, size=28)
df = pd.DataFrame({'Date': dates, 'Sales': sales})
print(df.head())

        Date  Sales
0 2023-02-01     13
1 2023-02-02     65
2 2023-02-03     32
3 2023-02-04     25
4 2023-02-05     50

In [95]:
def moving_average_column(df):
    df = df.sort_values(by='Date')
    
    avg = round(df['Sales'].rolling(window=7, min_periods=1).mean(),2)
    
    df['MovingAverage'] = avg
    
    return df

In [96]:
moving_average_column(df)

         Date  Sales  MovingAverage
0  2023-02-01     13          13.00
1  2023-02-02     65          39.00
2  2023-02-03     32          36.67
3  2023-02-04     25          33.75
4  2023-02-05     50          37.00
5  2023-02-06     78          43.83
6  2023-02-07     87          50.00
7  2023-02-08     17          50.57
8  2023-02-09     80          52.71
9  2023-02-10     61          56.86
10 2023-02-11     88          65.86
11 2023-02-12     52          66.14
12 2023-02-13     19          57.71
13 2023-02-14     31          49.71
14 2023-02-15     85          59.43
15 2023-02-16     62          56.86
16 2023-02-17     28          52.14
17 2023-02-18     46          46.14
18 2023-02-19     44          45.00
19 2023-02-20     54          50.00
20 2023-02-21     99          59.71
21 2023-02-22     60          56.14
22 2023-02-23     56          55.29
23 2023-02-24     98          65.29
24 2023-02-25     31          63.14
25 2023-02-26     42          62.86
26 2023-02-27     51          62.43
27 2023-02-28     43          54.43

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [90]:
dates = pd.date_range(start='2022-02-01', periods=7, freq='D')
df = pd.DataFrame({'Date': dates})

In [92]:
def weekday(df):
    df['Weekday']=df['Date'].dt.day_name()
    return df

In [93]:
weekday(df)

        Date    Weekday
0 2022-02-01    Tuesday
1 2022-02-02  Wednesday
2 2022-02-03   Thursday
3 2022-02-04     Friday
4 2022-02-05   Saturday
5 2022-02-06     Sunday
6 2022-02-07     Monday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [98]:
dates = pd.date_range(start='2023-01-25', periods=10, freq='D')
df = pd.DataFrame({'Date': dates})

In [102]:
def dates(df):
    start = pd.Timestamp('2023-01-01')
    end = pd.Timestamp('2023-01-31')
    
    df = df.loc[(df['Date'].between(start, end))]
    
    return df

In [103]:
dates(df)

        Date
0 2023-01-25
1 2023-01-26
2 2023-01-27
3 2023-01-28
4 2023-01-29
5 2023-01-30
6 2023-01-31

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

Pandas is the first and foremost necessary library that needs to be imported to use basic functions of pandas.